In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\amit\appdata\roaming\python\python312\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\amit\appdata\roaming\python\python312\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amit\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\amit\appdata\roaming\python\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\amit\appdata\roaming\python\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\amit\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [6]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
s = pd.Series([1,2,3,4], index=["A",'B', 'C','D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [ ]:
data_1 = [[1,111,'ahmed'],
          [2,222,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
# type(data_1)
# print(data_1)
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
df.dtypes
df.dtypes

dtype('O')

In [16]:
data_2 = {'s1':[10,15,17,9],
          's2':[8,7,12,15],
          's3':['math','cs', 'stat','OR']}
df = pd.DataFrame(data_2)
df

   s1  s2    s3
0  10   8  math
1  15   7    cs
2  17  12  stat
3   9  15    OR

In [17]:
display(df)

   s1  s2    s3
0  10   8  math
1  15   7    cs
2  17  12  stat
3   9  15    OR

In [22]:
def abs():
    return f"hello"

In [35]:
class test:
    
    def __init__(self, name: str):
        self.name = name
    
    @property
    def info(self):
        """  
        this method get only info abut the name of std
        """
        
        return self. name

In [33]:
t1= test("George")
t1.info

'George'

In [51]:
data_1 = [[1,111,'ahmed'],
          [2,222,'Dai'],
          [3,333,'Youssef'],
          [4,444,'abdalla']
         ]
type(data_1)
# print(data_1)
df = pd.DataFrame(data_1,columns=["index","ID","Name"])
display(df)
# df.dtypes

   index   ID     Name
0      1  111    ahmed
1      2  222      Dai
2      3  333  Youssef
3      4  444  abdalla

In [49]:
df["Name"] = df ["Name"].astype("category")
df.dtypes

index       int64
ID          int64
Name     category
dtype: object

In [54]:
# EDA  Exploratory DATA ANALYSIS
df.head(2)

   index   ID   Name
0      1  111  ahmed
1      2  222    Dai

In [56]:
df.tail(1)

   index   ID     Name
3      4  444  abdalla